[Killed] ObjectLiteral
src/api_test/endpoints/Comments.ts:12:16
   public async createComment(postSlug, postCommentBody, accessToken): Promise<AxiosResponse> {
     return this.restClient.sendPost({
       route: `?slug=${postSlug}`,
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
       data: postCommentBody,
     });
killedBy: US004 - Create a comment without field validation Comment creation attempt with  Verify that when a comment is created the number of comments increases by one
statusReason: TypeError: Cannot read properties of undefined (reading 'numComments')

[Killed] ObjectLiteral
src/api_test/endpoints/Comments.ts:44:16
   public async upVoteComment(accessToken, commentId): Promise<AxiosResponse> {
     return this.restClient.sendPost({
       route: `/${commentId}/upvote`,
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
     });
   }
killedBy: US008 - SSDs flow tests based on Acceptance Criteria SSD Alternative 1 - Member upvotes comment Verify upvote success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/api_test/endpoints/Comments.ts:67:11
     let commentData: any;
 
     for (let i of response.data.comments) {
-      if (i.text == comment && i.member.user.username == regBody.username) {
+      if (false) {
         commentData = {
           commentId: i.commentId,
killedBy: US008 - SSDs flow tests based on Acceptance Criteria SSD Alternative 1 - Member upvotes comment Check the +1 increment on score in post page
statusReason: TypeError: Cannot read properties of undefined (reading 'points')

[Killed] ConditionalExpression
src/api_test/endpoints/Comments.ts:67:11
     let commentData: any;
 
     for (let i of response.data.comments) {
-      if (i.text == comment && i.member.user.username == regBody.username) {
+      if (true) {
         commentData = {
           commentId: i.commentId,
killedBy: US008 - SSDs flow tests based on Acceptance Criteria SSD Alternative 1 - Member upvotes comment Check the +1 increment on score in post page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
src/api_test/endpoints/Comments.ts:68:23
 
     for (let i of response.data.comments) {
       if (i.text == comment && i.member.user.username == regBody.username) {
-        commentData = {
-          commentId: i.commentId,
-          username: i.member.user.username,
-          parentCommentId: i.parentCommentId,
-          points: i.points,
-        };
+        commentData = {};
         return commentData;
       }
killedBy: US008 - SSDs flow tests based on Acceptance Criteria SSD Alternative 1 - Member upvotes comment Check the +1 increment on score in post page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: NaN
Received: undefined

[Timeout] ArrowFunction
src/api_test/endpoints/Comments.ts:80:30
   }
 
   public async sleep(delay: number) {
-    return await new Promise((f) => setTimeout(f, delay));
+    return await new Promise(() => undefined);
   }
 }
