[NoCoverage] BooleanLiteral
src/shared/core/AppError.ts:7:13
 export namespace AppError {
   export class UnexpectedError extends Result<UseCaseError> {
     public constructor(err: any) {
-      super(false, {
+      super(true, {
         message: `An unexpected error occurred.`,
         error: err,
