[Killed] ConditionalExpression
src/shared/core/Guard.ts:15:11
 export class Guard {
   public static combine(guardResults: Result<any>[]): Result<GuardResponse> {
     for (let result of guardResults) {
-      if (result.isFailure) return result;
+      if (false) return result;
     }
 
killedBy: guard combined results knows that one success, one failure equates to overall failure
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/shared/core/Guard.ts:15:11
 export class Guard {
   public static combine(guardResults: Result<any>[]): Result<GuardResponse> {
     for (let result of guardResults) {
-      if (result.isFailure) return result;
+      if (true) return result;
     }
 
killedBy: guard combined results knows that one success, one failure equates to overall failure
statusReason: Error: expect(received).toBeFalsy()

Received: true

[NoCoverage] EqualityOperator
src/shared/core/Guard.ts:22:12
   }
 
   public static greaterThan(minValue: number, actualValue: number): Result<GuardResponse> {
-    return actualValue > minValue
+    return actualValue <= minValue
       ? Result.ok<GuardResponse>()
       : Result.fail<GuardResponse>(

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:22:12
   }
 
   public static greaterThan(minValue: number, actualValue: number): Result<GuardResponse> {
-    return actualValue > minValue
+    return false
       ? Result.ok<GuardResponse>()
       : Result.fail<GuardResponse>(

[Survived] EqualityOperator
src/shared/core/Guard.ts:30:12
   }
 
   public static againstAtLeast(numChars: number, text: string): Result<GuardResponse> {
-    return text.length >= numChars
+    return text.length > numChars
       ? Result.ok<GuardResponse>()
       : Result.fail<GuardResponse>(`Text is not at least ${numChars} chars.`);

[Survived] ConditionalExpression
src/shared/core/Guard.ts:30:12
   }
 
   public static againstAtLeast(numChars: number, text: string): Result<GuardResponse> {
-    return text.length >= numChars
+    return true
       ? Result.ok<GuardResponse>()
       : Result.fail<GuardResponse>(`Text is not at least ${numChars} chars.`);

[Survived] EqualityOperator
src/shared/core/Guard.ts:36:12
   }
 
   public static againstAtMost(numChars: number, text: string): Result<GuardResponse> {
-    return text.length <= numChars
+    return text.length < numChars
       ? Result.ok<GuardResponse>()
       : Result.fail<GuardResponse>(`Text is greater than ${numChars} chars.`);

[Survived] ConditionalExpression
src/shared/core/Guard.ts:36:12
   }
 
   public static againstAtMost(numChars: number, text: string): Result<GuardResponse> {
-    return text.length <= numChars
+    return true
       ? Result.ok<GuardResponse>()
       : Result.fail<GuardResponse>(`Text is greater than ${numChars} chars.`);

[Killed] EqualityOperator
src/shared/core/Guard.ts:42:30
   }
 
   public static againstNullOrUndefined(argument: any, argumentName: string): Result<GuardResponse> {
-    if (argument === null || argument === undefined) {
+    if (argument === null || argument !== undefined) {
       return Result.fail<GuardResponse>(`${argumentName} is null or undefined`);
     } else {
killedBy: guard against null or undefined knows that value provided equates to success
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/shared/core/Guard.ts:42:9
   }
 
   public static againstNullOrUndefined(argument: any, argumentName: string): Result<GuardResponse> {
-    if (argument === null || argument === undefined) {
+    if (argument !== null || argument === undefined) {
       return Result.fail<GuardResponse>(`${argumentName} is null or undefined`);
     } else {
killedBy: guard against null or undefined knows that value provided equates to success
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/shared/core/Guard.ts:52:11
   public static againstNullOrUndefinedBulk(args: GuardArgumentCollection): Result<GuardResponse> {
     for (let arg of args) {
       const result = this.againstNullOrUndefined(arg.argument, arg.argumentName);
-      if (result.isFailure) return result;
+      if (false) return result;
     }
 
killedBy: guard against null or undefined bulk knows that a single null value equates to failure
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Survived] ConditionalExpression
src/shared/core/Guard.ts:52:11
   public static againstNullOrUndefinedBulk(args: GuardArgumentCollection): Result<GuardResponse> {
     for (let arg of args) {
       const result = this.againstNullOrUndefined(arg.argument, arg.argumentName);
-      if (result.isFailure) return result;
+      if (true) return result;
     }
 

[NoCoverage] BooleanLiteral
src/shared/core/Guard.ts:63:19
     validValues: any[],
     argumentName: string,
   ): Result<GuardResponse> {
-    let isValid = false;
+    let isValid = true;
     for (let validValue of validValues) {
       if (value === validValue) {

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:65:11
   ): Result<GuardResponse> {
     let isValid = false;
     for (let validValue of validValues) {
-      if (value === validValue) {
+      if (false) {
         isValid = true;
       }

[NoCoverage] EqualityOperator
src/shared/core/Guard.ts:65:11
   ): Result<GuardResponse> {
     let isValid = false;
     for (let validValue of validValues) {
-      if (value === validValue) {
+      if (value !== validValue) {
         isValid = true;
       }

[NoCoverage] BooleanLiteral
src/shared/core/Guard.ts:66:19
     let isValid = false;
     for (let validValue of validValues) {
       if (value === validValue) {
-        isValid = true;
+        isValid = false;
       }
     }

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:70:9
       }
     }
 
-    if (isValid) {
+    if (true) {
       return Result.ok<GuardResponse>();
     } else {

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:70:9
       }
     }
 
-    if (isValid) {
+    if (false) {
       return Result.ok<GuardResponse>();
     } else {

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:87:23
     max: number,
     argumentName: string,
   ): Result<GuardResponse> {
-    const isInRange = num >= min && num <= max;
+    const isInRange = false;
     if (!isInRange) {
       return Result.fail<GuardResponse>(`${argumentName} is not within range ${min} to ${max}.`);

[NoCoverage] LogicalOperator
src/shared/core/Guard.ts:87:23
     max: number,
     argumentName: string,
   ): Result<GuardResponse> {
-    const isInRange = num >= min && num <= max;
+    const isInRange = num >= min || num <= max;
     if (!isInRange) {
       return Result.fail<GuardResponse>(`${argumentName} is not within range ${min} to ${max}.`);

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:88:9
     argumentName: string,
   ): Result<GuardResponse> {
     const isInRange = num >= min && num <= max;
-    if (!isInRange) {
+    if (false) {
       return Result.fail<GuardResponse>(`${argumentName} is not within range ${min} to ${max}.`);
     } else {

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:88:9
     argumentName: string,
   ): Result<GuardResponse> {
     const isInRange = num >= min && num <= max;
-    if (!isInRange) {
+    if (true) {
       return Result.fail<GuardResponse>(`${argumentName} is not within range ${min} to ${max}.`);
     } else {

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:105:11
 
     for (let num of numbers) {
       const numIsInRangeResult = this.inRange(num, min, max, argumentName);
-      if (!numIsInRangeResult.isFailure) failingResult = numIsInRangeResult;
+      if (false) failingResult = numIsInRangeResult;
     }
 

[NoCoverage] BooleanLiteral
src/shared/core/Guard.ts:105:11
 
     for (let num of numbers) {
       const numIsInRangeResult = this.inRange(num, min, max, argumentName);
-      if (!numIsInRangeResult.isFailure) failingResult = numIsInRangeResult;
+      if (numIsInRangeResult.isFailure) failingResult = numIsInRangeResult;
     }
 

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:108:9
       if (!numIsInRangeResult.isFailure) failingResult = numIsInRangeResult;
     }
 
-    if (failingResult) {
+    if (true) {
       return Result.fail<GuardResponse>(`${argumentName} is not within the range.`);
     } else {

[NoCoverage] ConditionalExpression
src/shared/core/Guard.ts:108:9
       if (!numIsInRangeResult.isFailure) failingResult = numIsInRangeResult;
     }
 
-    if (failingResult) {
+    if (false) {
       return Result.fail<GuardResponse>(`${argumentName} is not within the range.`);
     } else {
