[Killed] ObjectLiteral
src/api_test/endpoints/Posts.ts:30:16
   public async createPost(postBody, accessToken): Promise<AxiosResponse> {
     return this.restClient.sendPost({
       route: '/',
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
       data: postBody,
     });
killedBy: US002 - Member correctly makes a post (SSD1) according to the AC1, AC3, AC8 Post1 - Create Post with text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[NoCoverage] ObjectLiteral
src/api_test/endpoints/Posts.ts:46:16
   public async upVotePost(accessToken, getPostBySlug): Promise<AxiosResponse> {
     return this.restClient.sendPost({
       route: `/upvote`,
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
       data: getPostBySlug,
     });

[Survived] LogicalOperator
src/api_test/endpoints/Posts.ts:69:11
 
   public getSlug(response, postBody, regBody) {
     for (let i of response.data.posts) {
-      if (i.title == postBody.title && i.memberPostedBy.user.username == regBody.username) {
+      if (i.title == postBody.title || i.memberPostedBy.user.username == regBody.username) {
         if (i.text == postBody.text || i.link == postBody.link) {
           return i.slug;

[Survived] EqualityOperator
src/api_test/endpoints/Posts.ts:69:40
 
   public getSlug(response, postBody, regBody) {
     for (let i of response.data.posts) {
-      if (i.title == postBody.title && i.memberPostedBy.user.username == regBody.username) {
+      if (i.title == postBody.title && i.memberPostedBy.user.username != regBody.username) {
         if (i.text == postBody.text || i.link == postBody.link) {
           return i.slug;

[Survived] LogicalOperator
src/api_test/endpoints/Posts.ts:70:13
   public getSlug(response, postBody, regBody) {
     for (let i of response.data.posts) {
       if (i.title == postBody.title && i.memberPostedBy.user.username == regBody.username) {
-        if (i.text == postBody.text || i.link == postBody.link) {
+        if (i.text == postBody.text && i.link == postBody.link) {
           return i.slug;
         }

[Survived] EqualityOperator
src/api_test/endpoints/Posts.ts:70:13
   public getSlug(response, postBody, regBody) {
     for (let i of response.data.posts) {
       if (i.title == postBody.title && i.memberPostedBy.user.username == regBody.username) {
-        if (i.text == postBody.text || i.link == postBody.link) {
+        if (i.text != postBody.text || i.link == postBody.link) {
           return i.slug;
         }
