[Killed] ConditionalExpression
src/shared/core/Result.ts:8:9
   private _value: T;
 
   public constructor(isSuccess: boolean, error?: T | string, value?: T) {
-    if (isSuccess && error) {
+    if (true) {
       throw new Error('InvalidOperation: A result cannot be successful and contain an error');
     }
killedBy: guard combined results knows that two successful results equates to success
statusReason: Error: InvalidOperation: A result cannot be successful and contain an error

[Killed] LogicalOperator
src/shared/core/Result.ts:8:9
   private _value: T;
 
   public constructor(isSuccess: boolean, error?: T | string, value?: T) {
-    if (isSuccess && error) {
+    if (isSuccess || error) {
       throw new Error('InvalidOperation: A result cannot be successful and contain an error');
     }
killedBy: guard combined results knows that two successful results equates to success
statusReason: Error: InvalidOperation: A result cannot be successful and contain an error

[Killed] BooleanLiteral
src/shared/core/Result.ts:11:23
     if (isSuccess && error) {
       throw new Error('InvalidOperation: A result cannot be successful and contain an error');
     }
-    if (!isSuccess && !error) {
+    if (!isSuccess && error) {
       throw new Error('InvalidOperation: A failing result needs to contain an error message');
     }
killedBy: guard combined results knows that one success, one failure equates to overall failure
statusReason: Error: InvalidOperation: A failing result needs to contain an error message

[Killed] BooleanLiteral
src/shared/core/Result.ts:11:9
     if (isSuccess && error) {
       throw new Error('InvalidOperation: A result cannot be successful and contain an error');
     }
-    if (!isSuccess && !error) {
+    if (isSuccess && !error) {
       throw new Error('InvalidOperation: A failing result needs to contain an error message');
     }
killedBy: guard combined results knows that two successful results equates to success
statusReason: Error: InvalidOperation: A failing result needs to contain an error message

[Killed] BooleanLiteral
src/shared/core/Result.ts:16:22
     }
 
     this.isSuccess = isSuccess;
-    this.isFailure = !isSuccess;
+    this.isFailure = isSuccess;
     this.error = error;
     this._value = value;
killedBy: guard combined results knows that one success, one failure equates to overall failure
statusReason: Error: expect(received).toBeFalsy()

Received: true

[NoCoverage] ConditionalExpression
src/shared/core/Result.ts:24:9
   }
 
   public getValue(): T {
-    if (!this.isSuccess) {
+    if (true) {
       console.log(this.error);
       throw new Error("Can't get the value of an error result. Use 'errorValue' instead.");

[Survived] ConditionalExpression
src/shared/core/Result.ts:24:9
   }
 
   public getValue(): T {
-    if (!this.isSuccess) {
+    if (false) {
       console.log(this.error);
       throw new Error("Can't get the value of an error result. Use 'errorValue' instead.");

[Killed] BooleanLiteral
src/shared/core/Result.ts:37:26
   }
 
   public static ok<U>(value?: U): Result<U> {
-    return new Result<U>(true, null, value);
+    return new Result<U>(false, null, value);
   }
 
killedBy: guard combined results knows that two successful results equates to success
statusReason: Error: InvalidOperation: A failing result needs to contain an error message

[Killed] BooleanLiteral
src/shared/core/Result.ts:41:26
   }
 
   public static fail<U>(error: string): Result<U> {
-    return new Result<U>(false, error);
+    return new Result<U>(true, error);
   }
 
killedBy: guard combined results knows that one success, one failure equates to overall failure
statusReason: Error: InvalidOperation: A result cannot be successful and contain an error

[NoCoverage] ConditionalExpression
src/shared/core/Result.ts:46:11
 
   public static combine(results: Result<any>[]): Result<any> {
     for (let result of results) {
-      if (result.isFailure) return result;
+      if (true) return result;
     }
     return Result.ok();

[NoCoverage] ConditionalExpression
src/shared/core/Result.ts:46:11
 
   public static combine(results: Result<any>[]): Result<any> {
     for (let result of results) {
-      if (result.isFailure) return result;
+      if (false) return result;
     }
     return Result.ok();

[NoCoverage] BooleanLiteral
src/shared/core/Result.ts:62:12
   }
 
   isLeft(): this is Left<L, A> {
-    return true;
+    return false;
   }
 

[NoCoverage] BooleanLiteral
src/shared/core/Result.ts:66:12
   }
 
   isRight(): this is Right<L, A> {
-    return false;
+    return true;
   }
 }

[NoCoverage] BooleanLiteral
src/shared/core/Result.ts:78:12
   }
 
   isLeft(): this is Left<L, A> {
-    return false;
+    return true;
   }
 

[NoCoverage] BooleanLiteral
src/shared/core/Result.ts:82:12
   }
 
   isRight(): this is Right<L, A> {
-    return true;
+    return false;
   }
 }
