[Killed] ObjectLiteral
src/api_test/endpoints/Users.ts:45:16
   public async getMe(accessToken: string): Promise<AxiosResponse> {
     return this.restClient.sendGet({
       route: '/me',
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
     });
   }
killedBy: 1 - US011 - Member correctly logs in (SSD1) - AC2, AC3, AC4 2 - Validates authenticated member info after login
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ObjectLiteral
src/api_test/endpoints/Users.ts:63:16
   public async postLogout(accessToken: string): Promise<AxiosResponse> {
     return this.restClient.sendPost({
       route: '/logout',
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
     });
   }
killedBy: 1 - US012 - Logout Unsuccess 1.1 - Member already logged out tryes to log out again with same accesstToken
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Auth token not found. User is probably not logged in. Please login again.",
+   "message": "No access token provided",

[Killed] ObjectLiteral
src/api_test/endpoints/Users.ts:118:16
   public async getStatisticsByDate(date: string, statType: string, accessToken: string): Promise<AxiosResponse> {
     return this.restClient.sendGet({
       route: `/statistics/${date}/${statType}`,
-      headers: {
-        Authorization: accessToken,
-        Accept: 'application/json',
-        'Content-Type': 'application/json',
-      },
+      headers: {},
     });
   }
killedBy: US015- TEST AVERAGE comments per day with valid date test average comments per day
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 200
Received: 403
