[NoCoverage] EqualityOperator
src/shared/domain/Entity.ts:17:27
   }
 
   public equals(object?: Entity<T>): boolean {
-    if (object == null || object == undefined) {
+    if (object == null || object != undefined) {
       return false;
     }

[NoCoverage] ConditionalExpression
src/shared/domain/Entity.ts:17:9
   }
 
   public equals(object?: Entity<T>): boolean {
-    if (object == null || object == undefined) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/Entity.ts:18:14
 
   public equals(object?: Entity<T>): boolean {
     if (object == null || object == undefined) {
-      return false;
+      return true;
     }
 

[NoCoverage] ConditionalExpression
src/shared/domain/Entity.ts:21:9
       return false;
     }
 
-    if (this === object) {
+    if (true) {
       return true;
     }

[NoCoverage] EqualityOperator
src/shared/domain/Entity.ts:21:9
       return false;
     }
 
-    if (this === object) {
+    if (this !== object) {
       return true;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/Entity.ts:22:14
     }
 
     if (this === object) {
-      return true;
+      return false;
     }
 

[NoCoverage] ConditionalExpression
src/shared/domain/Entity.ts:25:9
       return true;
     }
 
-    if (!isEntity(object)) {
+    if (false) {
       return false;
     }

[NoCoverage] ConditionalExpression
src/shared/domain/Entity.ts:25:9
       return true;
     }
 
-    if (!isEntity(object)) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/Entity.ts:26:14
     }
 
     if (!isEntity(object)) {
-      return false;
+      return true;
     }
 
