[NoCoverage] ObjectLiteral
infra/http/utils/Middleware.ts:13:36
   }
 
   private endRequest(status: 400 | 401 | 403, message: string, res: any): any {
-    return res.status(status).send({ message });
+    return res.status(status).send({});
   }
 

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:20:11
     return async (req, res, next) => {
       const token = req.headers['authorization'];
       // Confirm that the token was signed with our signature.
-      if (token) {
+      if (false) {
         const decoded = await this.authService.decodeJWT(token);
         const signatureFailed = !!decoded === false;

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:20:11
     return async (req, res, next) => {
       const token = req.headers['authorization'];
       // Confirm that the token was signed with our signature.
-      if (token) {
+      if (true) {
         const decoded = await this.authService.decodeJWT(token);
         const signatureFailed = !!decoded === false;

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:22:33
       // Confirm that the token was signed with our signature.
       if (token) {
         const decoded = await this.authService.decodeJWT(token);
-        const signatureFailed = !!decoded === false;
+        const signatureFailed = false;
 
         if (signatureFailed) {

[NoCoverage] EqualityOperator
infra/http/utils/Middleware.ts:22:33
       // Confirm that the token was signed with our signature.
       if (token) {
         const decoded = await this.authService.decodeJWT(token);
-        const signatureFailed = !!decoded === false;
+        const signatureFailed = !!decoded !== false;
 
         if (signatureFailed) {

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:24:13
         const decoded = await this.authService.decodeJWT(token);
         const signatureFailed = !!decoded === false;
 
-        if (signatureFailed) {
+        if (true) {
           return this.endRequest(403, 'Token signature expired.', res);
         }

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:24:13
         const decoded = await this.authService.decodeJWT(token);
         const signatureFailed = !!decoded === false;
 
-        if (signatureFailed) {
+        if (false) {
           return this.endRequest(403, 'Token signature expired.', res);
         }

[NoCoverage] EqualityOperator
infra/http/utils/Middleware.ts:33:13
         const tokens = await this.authService.getTokens(username);
 
         // if the token was found, just continue the request.
-        if (tokens.length !== 0) {
+        if (tokens.length === 0) {
           req.decoded = decoded;
           return next();

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:33:13
         const tokens = await this.authService.getTokens(username);
 
         // if the token was found, just continue the request.
-        if (tokens.length !== 0) {
+        if (false) {
           req.decoded = decoded;
           return next();

[NoCoverage] BooleanLiteral
infra/http/utils/Middleware.ts:51:47
       // Confirm that the token was signed with our signature.
       if (token) {
         const decoded = await this.authService.decodeJWT(token);
-        const signatureFailed = !!decoded === false;
+        const signatureFailed = !!decoded === true;
 
         if (signatureFailed) {

[NoCoverage] ObjectLiteral
infra/http/utils/Middleware.ts:79:22
   }
 
   public static createRateLimit(mins: number, maxRequests: number) {
-    return rateLimit({
-      windowMs: mins * 60 * 1000,
-      max: maxRequests,
-    });
+    return rateLimit({});
   }
 

[NoCoverage] ArithmeticOperator
infra/http/utils/Middleware.ts:80:17
 
   public static createRateLimit(mins: number, maxRequests: number) {
     return rateLimit({
-      windowMs: mins * 60 * 1000,
+      windowMs: mins / 60 * 1000,
       max: maxRequests,
     });

[NoCoverage] ArithmeticOperator
infra/http/utils/Middleware.ts:80:17
 
   public static createRateLimit(mins: number, maxRequests: number) {
     return rateLimit({
-      windowMs: mins * 60 * 1000,
+      windowMs: mins * 60 / 1000,
       max: maxRequests,
     });

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:86:9
   }
 
   public static restrictedUrl(req, res, next) {
-    if (!isProduction) {
+    if (false) {
       return next();
     }

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:86:9
   }
 
   public static restrictedUrl(req, res, next) {
-    if (!isProduction) {
+    if (true) {
       return next();
     }

[NoCoverage] ArrayDeclaration
infra/http/utils/Middleware.ts:90:32
       return next();
     }
 
-    const approvedDomainList = ['https://khalilstemmler.com'];
+    const approvedDomainList = [];
 
     const domain = req.headers.origin;

[NoCoverage] BooleanLiteral
infra/http/utils/Middleware.ts:94:27
 
     const domain = req.headers.origin;
 
-    const isValidDomain = !!approvedDomainList.find((d) => d === domain);
+    const isValidDomain = !approvedDomainList.find(d => d === domain);
     console.log(`Domain =${domain}, valid?=${isValidDomain}`);
 

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:94:60
 
     const domain = req.headers.origin;
 
-    const isValidDomain = !!approvedDomainList.find((d) => d === domain);
+    const isValidDomain = !!approvedDomainList.find((d) => true);
     console.log(`Domain =${domain}, valid?=${isValidDomain}`);
 

[NoCoverage] BooleanLiteral
infra/http/utils/Middleware.ts:97:9
     const isValidDomain = !!approvedDomainList.find((d) => d === domain);
     console.log(`Domain =${domain}, valid?=${isValidDomain}`);
 
-    if (!isValidDomain) {
+    if (isValidDomain) {
       return res.status(403).json({ message: 'Unauthorized' });
     } else {

[NoCoverage] ConditionalExpression
infra/http/utils/Middleware.ts:97:9
     const isValidDomain = !!approvedDomainList.find((d) => d === domain);
     console.log(`Domain =${domain}, valid?=${isValidDomain}`);
 
-    if (!isValidDomain) {
+    if (true) {
       return res.status(403).json({ message: 'Unauthorized' });
     } else {
