[NoCoverage] ConditionalExpression
src/shared/domain/Identifier.ts:7:9
   }
 
   equals(id?: Identifier<T>): boolean {
-    if (id === null || id === undefined) {
+    if (false) {
       return false;
     }

[NoCoverage] ConditionalExpression
src/shared/domain/Identifier.ts:7:9
   }
 
   equals(id?: Identifier<T>): boolean {
-    if (id === null || id === undefined) {
+    if (false || id === undefined) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/Identifier.ts:8:14
 
   equals(id?: Identifier<T>): boolean {
     if (id === null || id === undefined) {
-      return false;
+      return true;
     }
     if (!(id instanceof this.constructor)) {

[NoCoverage] ConditionalExpression
src/shared/domain/Identifier.ts:10:9
     if (id === null || id === undefined) {
       return false;
     }
-    if (!(id instanceof this.constructor)) {
+    if (false) {
       return false;
     }

[NoCoverage] ConditionalExpression
src/shared/domain/Identifier.ts:10:9
     if (id === null || id === undefined) {
       return false;
     }
-    if (!(id instanceof this.constructor)) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/Identifier.ts:11:14
       return false;
     }
     if (!(id instanceof this.constructor)) {
-      return false;
+      return true;
     }
     return id.toValue() === this.value;

[NoCoverage] EqualityOperator
src/shared/domain/Identifier.ts:13:12
     if (!(id instanceof this.constructor)) {
       return false;
     }
-    return id.toValue() === this.value;
+    return id.toValue() !== this.value;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/Identifier.ts:13:12
     if (!(id instanceof this.constructor)) {
       return false;
     }
-    return id.toValue() === this.value;
+    return true;
   }
 
