[NoCoverage] ConditionalExpression
src/shared/domain/ValueObject.ts:22:24
   }
 
   public equals(vo?: ValueObject<T>): boolean {
-    if (vo === null || vo === undefined) {
+    if (vo === null || false) {
       return false;
     }

[NoCoverage] EqualityOperator
src/shared/domain/ValueObject.ts:22:9
   }
 
   public equals(vo?: ValueObject<T>): boolean {
-    if (vo === null || vo === undefined) {
+    if (vo !== null || vo === undefined) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/ValueObject.ts:23:14
 
   public equals(vo?: ValueObject<T>): boolean {
     if (vo === null || vo === undefined) {
-      return false;
+      return true;
     }
     if (vo.props === undefined) {

[NoCoverage] ConditionalExpression
src/shared/domain/ValueObject.ts:25:9
     if (vo === null || vo === undefined) {
       return false;
     }
-    if (vo.props === undefined) {
+    if (true) {
       return false;
     }

[NoCoverage] EqualityOperator
src/shared/domain/ValueObject.ts:25:9
     if (vo === null || vo === undefined) {
       return false;
     }
-    if (vo.props === undefined) {
+    if (vo.props !== undefined) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/shared/domain/ValueObject.ts:26:14
       return false;
     }
     if (vo.props === undefined) {
-      return false;
+      return true;
     }
     return JSON.stringify(this.props) === JSON.stringify(vo.props);

[NoCoverage] ConditionalExpression
src/shared/domain/ValueObject.ts:28:12
     if (vo.props === undefined) {
       return false;
     }
-    return JSON.stringify(this.props) === JSON.stringify(vo.props);
+    return false;
   }
 }

[NoCoverage] EqualityOperator
src/shared/domain/ValueObject.ts:28:12
     if (vo.props === undefined) {
       return false;
     }
-    return JSON.stringify(this.props) === JSON.stringify(vo.props);
+    return JSON.stringify(this.props) !== JSON.stringify(vo.props);
   }
 }
