[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:29:12
   }
 
   private isCurrentItem(item: T): boolean {
-    return this.currentItems.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return true;
   }
 

[NoCoverage] EqualityOperator
src/shared/domain/WatchedList.ts:29:12
   }
 
   private isCurrentItem(item: T): boolean {
-    return this.currentItems.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return this.currentItems.filter((v: T) => this.compareItems(item, v)).length === 0;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:33:12
   }
 
   private isNewItem(item: T): boolean {
-    return this.new.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:33:12
   }
 
   private isNewItem(item: T): boolean {
-    return this.new.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return false;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:37:12
   }
 
   private isRemovedItem(item: T): boolean {
-    return this.removed.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:37:12
   }
 
   private isRemovedItem(item: T): boolean {
-    return this.removed.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return false;
   }
 

[NoCoverage] BooleanLiteral
src/shared/domain/WatchedList.ts:41:39
   }
 
   private removeFromNew(item: T): void {
-    this.new = this.new.filter((v) => !this.compareItems(v, item));
+    this.new = this.new.filter((v) => this.compareItems(v, item));
   }
 

[NoCoverage] MethodExpression
src/shared/domain/WatchedList.ts:41:16
   }
 
   private removeFromNew(item: T): void {
-    this.new = this.new.filter((v) => !this.compareItems(v, item));
+    this.new = this.new;
   }
 

[NoCoverage] MethodExpression
src/shared/domain/WatchedList.ts:45:25
   }
 
   private removeFromCurrent(item: T): void {
-    this.currentItems = this.currentItems.filter((v) => !this.compareItems(item, v));
+    this.currentItems = this.currentItems;
   }
 

[NoCoverage] BooleanLiteral
src/shared/domain/WatchedList.ts:45:57
   }
 
   private removeFromCurrent(item: T): void {
-    this.currentItems = this.currentItems.filter((v) => !this.compareItems(item, v));
+    this.currentItems = this.currentItems.filter((v) => this.compareItems(item, v));
   }
 

[NoCoverage] BooleanLiteral
src/shared/domain/WatchedList.ts:49:47
   }
 
   private removeFromRemoved(item: T): void {
-    this.removed = this.removed.filter((v) => !this.compareItems(item, v));
+    this.removed = this.removed.filter((v) => this.compareItems(item, v));
   }
 

[NoCoverage] MethodExpression
src/shared/domain/WatchedList.ts:49:20
   }
 
   private removeFromRemoved(item: T): void {
-    this.removed = this.removed.filter((v) => !this.compareItems(item, v));
+    this.removed = this.removed;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:53:12
   }
 
   private wasAddedInitially(item: T): boolean {
-    return this.initial.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return false;
   }
 

[NoCoverage] ArrowFunction
src/shared/domain/WatchedList.ts:53:32
   }
 
   private wasAddedInitially(item: T): boolean {
-    return this.initial.filter((v: T) => this.compareItems(item, v)).length !== 0;
+    return this.initial.filter(() => undefined).length !== 0;
   }
 

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:61:9
   }
 
   public add(item: T): void {
-    if (this.isRemovedItem(item)) {
+    if (false) {
       this.removeFromRemoved(item);
     }

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:61:9
   }
 
   public add(item: T): void {
-    if (this.isRemovedItem(item)) {
+    if (true) {
       this.removeFromRemoved(item);
     }

[NoCoverage] BooleanLiteral
src/shared/domain/WatchedList.ts:65:9
       this.removeFromRemoved(item);
     }
 
-    if (!this.isNewItem(item) && !this.wasAddedInitially(item)) {
+    if (this.isNewItem(item) && !this.wasAddedInitially(item)) {
       this.new.push(item);
     }

[NoCoverage] BooleanLiteral
src/shared/domain/WatchedList.ts:65:34
       this.removeFromRemoved(item);
     }
 
-    if (!this.isNewItem(item) && !this.wasAddedInitially(item)) {
+    if (!this.isNewItem(item) && this.wasAddedInitially(item)) {
       this.new.push(item);
     }

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:69:9
       this.new.push(item);
     }
 
-    if (!this.isCurrentItem(item)) {
+    if (true) {
       this.currentItems.push(item);
     }

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:69:9
       this.new.push(item);
     }
 
-    if (!this.isCurrentItem(item)) {
+    if (false) {
       this.currentItems.push(item);
     }

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:77:9
   public remove(item: T): void {
     this.removeFromCurrent(item);
 
-    if (this.isNewItem(item)) {
+    if (true) {
       this.removeFromNew(item);
       return;

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:77:9
   public remove(item: T): void {
     this.removeFromCurrent(item);
 
-    if (this.isNewItem(item)) {
+    if (false) {
       this.removeFromNew(item);
       return;

[NoCoverage] BooleanLiteral
src/shared/domain/WatchedList.ts:82:9
       return;
     }
 
-    if (!this.isRemovedItem(item)) {
+    if (this.isRemovedItem(item)) {
       this.removed.push(item);
     }

[NoCoverage] ConditionalExpression
src/shared/domain/WatchedList.ts:82:9
       return;
     }
 
-    if (!this.isRemovedItem(item)) {
+    if (false) {
       this.removed.push(item);
     }
