[NoCoverage] BooleanLiteral
shared/domain/events/DomainEvents.ts:18:28
    */
 
   public static markAggregateForDispatch(aggregate: AggregateRoot<any>): void {
-    const aggregateFound = !!this.findMarkedAggregateByID(aggregate.id);
+    const aggregateFound = !this.findMarkedAggregateByID(aggregate.id);
 
     if (!aggregateFound) {

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:20:9
   public static markAggregateForDispatch(aggregate: AggregateRoot<any>): void {
     const aggregateFound = !!this.findMarkedAggregateByID(aggregate.id);
 
-    if (!aggregateFound) {
+    if (false) {
       this.markedAggregates.push(aggregate);
     }

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:20:9
   public static markAggregateForDispatch(aggregate: AggregateRoot<any>): void {
     const aggregateFound = !!this.findMarkedAggregateByID(aggregate.id);
 
-    if (!aggregateFound) {
+    if (true) {
       this.markedAggregates.push(aggregate);
     }

[NoCoverage] ArrowFunction
shared/domain/events/DomainEvents.ts:26:36
   }
 
   private static dispatchAggregateEvents(aggregate: AggregateRoot<any>): void {
-    aggregate.domainEvents.forEach((event: IDomainEvent) => this.dispatch(event));
+    aggregate.domainEvents.forEach(() => undefined);
   }
 

[NoCoverage] ArrowFunction
shared/domain/events/DomainEvents.ts:30:51
   }
 
   private static removeAggregateFromMarkedDispatchList(aggregate: AggregateRoot<any>): void {
-    const index = this.markedAggregates.findIndex((a) => a.equals(aggregate));
+    const index = this.markedAggregates.findIndex(() => undefined);
     this.markedAggregates.splice(index, 1);
   }

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:37:11
   private static findMarkedAggregateByID(id: UniqueEntityID): AggregateRoot<any> {
     let found: AggregateRoot<any> = null;
     for (let aggregate of this.markedAggregates) {
-      if (aggregate.id.equals(id)) {
+      if (true) {
         found = aggregate;
       }

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:37:11
   private static findMarkedAggregateByID(id: UniqueEntityID): AggregateRoot<any> {
     let found: AggregateRoot<any> = null;
     for (let aggregate of this.markedAggregates) {
-      if (aggregate.id.equals(id)) {
+      if (false) {
         found = aggregate;
       }

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:48:9
   public static dispatchEventsForAggregate(id: UniqueEntityID): void {
     const aggregate = this.findMarkedAggregateByID(id);
 
-    if (aggregate) {
+    if (false) {
       this.dispatchAggregateEvents(aggregate);
       aggregate.clearEvents();

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:48:9
   public static dispatchEventsForAggregate(id: UniqueEntityID): void {
     const aggregate = this.findMarkedAggregateByID(id);
 
-    if (aggregate) {
+    if (true) {
       this.dispatchAggregateEvents(aggregate);
       aggregate.clearEvents();

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:56:9
   }
 
   public static register(callback: (event: IDomainEvent) => void, eventClassName: string): void {
-    if (!this.handlersMap.hasOwnProperty(eventClassName)) {
+    if (true) {
       this.handlersMap[eventClassName] = [];
     }

[NoCoverage] BooleanLiteral
shared/domain/events/DomainEvents.ts:56:9
   }
 
   public static register(callback: (event: IDomainEvent) => void, eventClassName: string): void {
-    if (!this.handlersMap.hasOwnProperty(eventClassName)) {
+    if (this.handlersMap.hasOwnProperty(eventClassName)) {
       this.handlersMap[eventClassName] = [];
     }

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:73:9
   private static dispatch(event: IDomainEvent): void {
     const eventClassName: string = event.constructor.name;
 
-    if (this.handlersMap.hasOwnProperty(eventClassName)) {
+    if (false) {
       const handlers: any[] = this.handlersMap[eventClassName];
       for (let handler of handlers) {

[NoCoverage] ConditionalExpression
shared/domain/events/DomainEvents.ts:73:9
   private static dispatch(event: IDomainEvent): void {
     const eventClassName: string = event.constructor.name;
 
-    if (this.handlersMap.hasOwnProperty(eventClassName)) {
+    if (true) {
       const handlers: any[] = this.handlersMap[eventClassName];
       for (let handler of handlers) {
