[Survived] ConditionalExpression
database/sequelize/config/config.js:46:14
 
 module.exports = databaseCredentials;
 
-const mode = DDD_FORUM_IS_PRODUCTION === "true" ? 'prod' : 'dev';
+const mode = true ? 'prod' : 'dev';
 
 console.log(`[DB]: Connecting to the database in ${mode} mode.`)

[Survived] ConditionalExpression
database/sequelize/config/config.js:46:14
 
 module.exports = databaseCredentials;
 
-const mode = DDD_FORUM_IS_PRODUCTION === "true" ? 'prod' : 'dev';
+const mode = false ? 'prod' : 'dev';
 
 console.log(`[DB]: Connecting to the database in ${mode} mode.`)

[Survived] ConditionalExpression
database/sequelize/config/config.js:50:29
 
 console.log(`[DB]: Connecting to the database in ${mode} mode.`)
 
-module.exports.connection = DDD_FORUM_IS_PRODUCTION === "true"
+module.exports.connection = false
   ? new Sequelize(CLEARDB_DATABASE_URL) 
   : new Sequelize(database, username, password, {

[Survived] BooleanLiteral
database/sequelize/config/config.js:57:27
     dialect,
     port: 3306,
     dialectOptions: {
-      multipleStatements: true,
+      multipleStatements: false,
     },
     pool: {

[Survived] BooleanLiteral
database/sequelize/config/config.js:64:14
       min: 0,
       idle: 10000
     },
-    logging: false
+    logging: true
   }
 );
