[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:13:35
 (async function createHooksForAggregateRoots() {
   const { BaseUser, Member, Post } = models;
 
-  BaseUser.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
+  BaseUser.addHook('afterCreate', () => undefined);
   BaseUser.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:14:36
   const { BaseUser, Member, Post } = models;
 
   BaseUser.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
-  BaseUser.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
+  BaseUser.addHook('afterDestroy', () => undefined);
   BaseUser.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'base_user_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:15:35
 
   BaseUser.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
-  BaseUser.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
+  BaseUser.addHook('afterUpdate', () => undefined);
   BaseUser.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'base_user_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:16:33
   BaseUser.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
-  BaseUser.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
+  BaseUser.addHook('afterSave', () => undefined);
   BaseUser.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
 

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:17:35
   BaseUser.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
-  BaseUser.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
+  BaseUser.addHook('afterUpsert', () => undefined);
 
   Member.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'member_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:19:33
   BaseUser.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
   BaseUser.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
 
-  Member.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'member_id'));
+  Member.addHook('afterCreate', () => undefined);
   Member.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'member_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:20:34
   BaseUser.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'base_user_id'));
 
   Member.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'member_id'));
-  Member.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'member_id'));
+  Member.addHook('afterDestroy', () => undefined);
   Member.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'member_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:21:33
 
   Member.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'member_id'));
-  Member.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'member_id'));
+  Member.addHook('afterUpdate', () => undefined);
   Member.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'member_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:22:31
   Member.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'member_id'));
-  Member.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'member_id'));
+  Member.addHook('afterSave', () => undefined);
   Member.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'member_id'));
 

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:23:33
   Member.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'member_id'));
-  Member.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'member_id'));
+  Member.addHook('afterUpsert', () => undefined);
 
   Post.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'post_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:25:31
   Member.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'member_id'));
   Member.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'member_id'));
 
-  Post.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'post_id'));
+  Post.addHook('afterCreate', () => undefined);
   Post.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'post_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:26:32
   Member.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'member_id'));
 
   Post.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'post_id'));
-  Post.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'post_id'));
+  Post.addHook('afterDestroy', () => undefined);
   Post.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'post_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:27:31
 
   Post.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'post_id'));
-  Post.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'post_id'));
+  Post.addHook('afterUpdate', () => undefined);
   Post.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'post_id'));

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:28:29
   Post.addHook('afterCreate', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'post_id'));
-  Post.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'post_id'));
+  Post.addHook('afterSave', () => undefined);
   Post.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'post_id'));
 

[NoCoverage] ArrowFunction
database/sequelize/hooks/index.ts:29:31
   Post.addHook('afterDestroy', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterUpdate', (m: any) => dispatchEventsCallback(m, 'post_id'));
   Post.addHook('afterSave', (m: any) => dispatchEventsCallback(m, 'post_id'));
-  Post.addHook('afterUpsert', (m: any) => dispatchEventsCallback(m, 'post_id'));
+  Post.addHook('afterUpsert', () => undefined);
 
   console.log('[Hooks]: Sequelize hooks setup.');
