[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:11:22
         base_user_id: {
           type: Sequelize.UUID,
           defaultValue: Sequelize.UUIDV4,
-          allowNull: false,
+          allowNull: true,
           primaryKey: true,
         },

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:12:23
           type: Sequelize.UUID,
           defaultValue: Sequelize.UUIDV4,
           allowNull: false,
-          primaryKey: true,
+          primaryKey: false,
         },
         user_email: {

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:16:22
         },
         user_email: {
           type: Sequelize.STRING(250),
-          allowNull: false,
+          allowNull: true,
           unique: true,
         },

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:21:22
         },
         is_email_verified: {
           type: Sequelize.BOOLEAN,
-          allowNull: false,
+          allowNull: true,
           defaultValue: false,
         },

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:22:25
         is_email_verified: {
           type: Sequelize.BOOLEAN,
           allowNull: false,
-          defaultValue: false,
+          defaultValue: true,
         },
         username: {

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:28:24
           type: Sequelize.STRING(250),
           allowNull: false,
         },
-        user_password: {
-          type: Sequelize.STRING,
-          allowNull: true,
-          defaultValue: null,
-        },
+        user_password: {},
         is_admin_user: {
           type: Sequelize.BOOLEAN,

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:30:22
         },
         user_password: {
           type: Sequelize.STRING,
-          allowNull: true,
+          allowNull: false,
           defaultValue: null,
         },

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:43:21
           allowNull: false,
           defaultValue: false,
         },
-        created_at: {
-          type: Sequelize.DATE,
-          allowNull: false,
-          defaultValue: Sequelize.literal('CURRENT_TIMESTAMP'),
-        },
+        created_at: {},
         updated_at: {
           type: Sequelize.DATE,

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:45:22
         },
         created_at: {
           type: Sequelize.DATE,
-          allowNull: false,
+          allowNull: true,
           defaultValue: Sequelize.literal('CURRENT_TIMESTAMP'),
         },

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:48:21
           allowNull: false,
           defaultValue: Sequelize.literal('CURRENT_TIMESTAMP'),
         },
-        updated_at: {
-          type: Sequelize.DATE,
-          allowNull: false,
-          defaultValue: Sequelize.literal('CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP'),
-        },
+        updated_at: {},
       });
     };

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:58:20
 
     const CREATE_MEMBER = () =>
       queryInterface.createTable('member', {
-        member_id: {
-          type: Sequelize.UUID,
-          defaultValue: Sequelize.UUIDV4,
-          allowNull: false,
-          primaryKey: true,
-        },
+        member_id: {},
         member_base_id: {
           type: Sequelize.UUID,

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:66:22
         },
         member_base_id: {
           type: Sequelize.UUID,
-          allowNull: false,
+          allowNull: true,
           primaryKey: true,
           references: {

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:77:22
         },
         reputation: {
           type: Sequelize.INTEGER,
-          allowNull: false,
+          allowNull: true,
           defaultValue: 0,
         },

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:112:22
         },
         type: {
           type: Sequelize.STRING(30),
-          allowNull: false,
+          allowNull: true,
         },
         title: {

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:114:16
           type: Sequelize.STRING(30),
           allowNull: false,
         },
-        title: {
-          type: Sequelize.TEXT,
-          allowNull: true,
-        },
+        title: {},
         text: {
           type: Sequelize.TEXT,

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:116:22
         },
         title: {
           type: Sequelize.TEXT,
-          allowNull: true,
+          allowNull: false,
         },
         text: {

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:122:15
           type: Sequelize.TEXT,
           allowNull: true,
         },
-        link: {
-          type: Sequelize.TEXT,
-          allowNull: true,
-        },
+        link: {},
         slug: {
           type: Sequelize.STRING(150),

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:126:15
           type: Sequelize.TEXT,
           allowNull: true,
         },
-        slug: {
-          type: Sequelize.STRING(150),
-          allowNull: false,
-        },
+        slug: {},
         points: {
           type: Sequelize.INTEGER,

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:128:22
         },
         slug: {
           type: Sequelize.STRING(150),
-          allowNull: false,
+          allowNull: true,
         },
         points: {

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:160:20
           allowNull: false,
           primaryKey: true,
         },
-        member_id: {
-          type: Sequelize.UUID,
-          allowNull: false,
-          references: {
-            model: 'member',
-            key: 'member_id',
-          },
-          onDelete: 'cascade',
-          onUpdate: 'cascade',
-        },
+        member_id: {},
         parent_comment_id: {
           type: Sequelize.UUID,

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:172:22
         },
         parent_comment_id: {
           type: Sequelize.UUID,
-          allowNull: true,
+          allowNull: false,
           references: {
             model: 'comment',

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:173:23
         parent_comment_id: {
           type: Sequelize.UUID,
           allowNull: true,
-          references: {
-            model: 'comment',
-            key: 'comment_id',
-          },
+          references: {},
           onDelete: 'cascade',
           onUpdate: 'cascade',

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:192:22
         },
         text: {
           type: Sequelize.TEXT,
-          allowNull: false,
+          allowNull: true,
         },
         points: {

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:194:17
           type: Sequelize.TEXT,
           allowNull: false,
         },
-        points: {
-          type: Sequelize.INTEGER,
-          allowNull: false,
-          defaultValue: 1,
-        },
+        points: {},
         created_at: {
           type: Sequelize.DATE,

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:213:23
 
     const CREATE_POST_VOTE = () =>
       queryInterface.createTable('post_vote', {
-        post_vote_id: {
-          type: Sequelize.UUID,
-          defaultValue: Sequelize.UUIDV4,
-          allowNull: false,
-          primaryKey: true,
-        },
+        post_vote_id: {},
         post_id: {
           type: Sequelize.UUID,

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:219:18
           allowNull: false,
           primaryKey: true,
         },
-        post_id: {
-          type: Sequelize.UUID,
-          allowNull: false,
-          references: {
-            model: 'post',
-            key: 'post_id',
-          },
-          onDelete: 'cascade',
-          onUpdate: 'cascade',
-        },
+        post_id: {},
         member_id: {
           type: Sequelize.UUID,

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:222:23
         post_id: {
           type: Sequelize.UUID,
           allowNull: false,
-          references: {
-            model: 'post',
-            key: 'post_id',
-          },
+          references: {},
           onDelete: 'cascade',
           onUpdate: 'cascade',

[NoCoverage] BooleanLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:241:22
         },
         type: {
           type: Sequelize.STRING(10),
-          allowNull: false,
+          allowNull: true,
         },
         created_at: {

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:257:26
 
     const CREATE_COMMENT_VOTE = () =>
       queryInterface.createTable('comment_vote', {
-        comment_vote_id: {
-          type: Sequelize.UUID,
-          defaultValue: Sequelize.UUIDV4,
-          allowNull: false,
-          primaryKey: true,
-        },
+        comment_vote_id: {},
         comment_id: {
           type: Sequelize.UUID,

[NoCoverage] ObjectLiteral
database/sequelize/migrations/20191004134636-initial-migration.ts:263:21
           allowNull: false,
           primaryKey: true,
         },
-        comment_id: {
-          type: Sequelize.UUID,
-          allowNull: false,
-          references: {
-            model: 'comment',
-            key: 'comment_id',
-          },
-          onDelete: 'cascade',
-          onUpdate: 'cascade',
-        },
+        comment_id: {},
         member_id: {
           type: Sequelize.UUID,

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:300:7
       });
 
     await runner.run([
-      () => CREATE_BASE_USER(),
+      () => undefined,
       () => CREATE_MEMBER(),
       () => CREATE_POST(),

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:301:7
 
     await runner.run([
       () => CREATE_BASE_USER(),
-      () => CREATE_MEMBER(),
+      () => undefined,
       () => CREATE_POST(),
       () => CREATE_COMMENT(),

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:302:7
     await runner.run([
       () => CREATE_BASE_USER(),
       () => CREATE_MEMBER(),
-      () => CREATE_POST(),
+      () => undefined,
       () => CREATE_COMMENT(),
       () => CREATE_POST_VOTE(),

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:303:7
       () => CREATE_BASE_USER(),
       () => CREATE_MEMBER(),
       () => CREATE_POST(),
-      () => CREATE_COMMENT(),
+      () => undefined,
       () => CREATE_POST_VOTE(),
       () => CREATE_COMMENT_VOTE(),

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:304:7
       () => CREATE_MEMBER(),
       () => CREATE_POST(),
       () => CREATE_COMMENT(),
-      () => CREATE_POST_VOTE(),
+      () => undefined,
       () => CREATE_COMMENT_VOTE(),
     ]);

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:305:7
       () => CREATE_POST(),
       () => CREATE_COMMENT(),
       () => CREATE_POST_VOTE(),
-      () => CREATE_COMMENT_VOTE(),
+      () => undefined,
     ]);
   },

[NoCoverage] ArrowFunction
database/sequelize/migrations/20191004134636-initial-migration.ts:310:24
   },
 
   down: (queryInterface, Sequelize) => {
-    return runner.run([() => queryInterface.dropTable('base_user')]);
+    return runner.run([() => undefined]);
   },
 };
