[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:8:20
       base_user_id: {
         type: DataTypes.UUID,
         defaultValue: DataTypes.UUIDV4,
-        allowNull: false,
+        allowNull: true,
         primaryKey: true,
       },

[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:13:20
       },
       user_email: {
         type: DataTypes.STRING(250),
-        allowNull: false,
+        allowNull: true,
         unique: true,
       },

[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:18:20
       },
       is_email_verified: {
         type: DataTypes.BOOLEAN,
-        allowNull: false,
+        allowNull: true,
         defaultValue: false,
       },

[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:37:20
       },
       user_password: {
         type: DataTypes.STRING,
-        allowNull: true,
+        allowNull: false,
         defaultValue: null,
       },

[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:42:19
       },
     },
     {
-      timestamps: true,
+      timestamps: false,
       underscored: true,
       tableName: 'base_user',

[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:43:20
     },
     {
       timestamps: true,
-      underscored: true,
+      underscored: false,
       tableName: 'base_user',
       indexes: [{ unique: true, fields: ['user_email'] }],

[Survived] BooleanLiteral
database/sequelize/models/BaseUser.ts:45:27
       timestamps: true,
       underscored: true,
       tableName: 'base_user',
-      indexes: [{ unique: true, fields: ['user_email'] }],
+      indexes: [{ unique: false, fields: ['user_email'] }],
     },
   );

[Survived] ObjectLiteral
database/sequelize/models/BaseUser.ts:45:17
       timestamps: true,
       underscored: true,
       tableName: 'base_user',
-      indexes: [{ unique: true, fields: ['user_email'] }],
+      indexes: [{}],
     },
   );
