[Survived] ObjectLiteral
database/sequelize/models/Comment.ts:5:19
   const Comment = sequelize.define(
     'comment',
     {
-      comment_id: {
-        type: DataTypes.UUID,
-        defaultValue: DataTypes.UUIDV4,
-        allowNull: false,
-        primaryKey: true,
-      },
+      comment_id: {},
       member_id: {
         type: DataTypes.UUID,

[Survived] BooleanLiteral
database/sequelize/models/Comment.ts:13:20
       },
       member_id: {
         type: DataTypes.UUID,
-        allowNull: false,
+        allowNull: true,
         references: {
           model: 'member',

[Survived] BooleanLiteral
database/sequelize/models/Comment.ts:33:20
       },
       parent_comment_id: {
         type: DataTypes.UUID,
-        allowNull: true,
+        allowNull: false,
         references: {
           model: 'comment',

[Survived] BooleanLiteral
database/sequelize/models/Comment.ts:43:20
       },
       text: {
         type: DataTypes.TEXT,
-        allowNull: false,
+        allowNull: true,
       },
       points: {

[Survived] ObjectLiteral
database/sequelize/models/Comment.ts:51:5
         defaultValue: 1,
       },
     },
-    {
-      timestamps: true,
-      underscored: true,
-      tableName: 'comment',
-    },
+    {},
   );
 
