[Survived] BooleanLiteral
database/sequelize/models/CommentVote.ts:33:20
       },
       type: {
         type: DataTypes.STRING(10),
-        allowNull: false,
+        allowNull: true,
       },
     },
