[Survived] ObjectLiteral
database/sequelize/models/Member.ts:4:5
 export default (sequelize, DataTypes) => {
   const Member = sequelize.define(
     'member',
-    {
-      member_id: {
-        type: DataTypes.UUID,
-        defaultValue: DataTypes.UUIDV4,
-        allowNull: false,
-        primaryKey: true,
-      },
-      member_base_id: {
-        type: DataTypes.UUID,
-        allowNull: false,
-        primaryKey: true,
-        references: {
-          model: 'base_user',
-          key: 'base_user_id',
-        },
-        onDelete: 'cascade',
-        onUpdate: 'cascade',
-      },
-      reputation: {
-        type: DataTypes.INTEGER,
-        allowNull: false,
-        defaultValue: 0,
-      },
-    },
+    {},
     {
       timestamps: true,

[Survived] ObjectLiteral
database/sequelize/models/Member.ts:5:18
   const Member = sequelize.define(
     'member',
     {
-      member_id: {
-        type: DataTypes.UUID,
-        defaultValue: DataTypes.UUIDV4,
-        allowNull: false,
-        primaryKey: true,
-      },
+      member_id: {},
       member_base_id: {
         type: DataTypes.UUID,

[Survived] ObjectLiteral
database/sequelize/models/Member.ts:11:23
         allowNull: false,
         primaryKey: true,
       },
-      member_base_id: {
-        type: DataTypes.UUID,
-        allowNull: false,
-        primaryKey: true,
-        references: {
-          model: 'base_user',
-          key: 'base_user_id',
-        },
-        onDelete: 'cascade',
-        onUpdate: 'cascade',
-      },
+      member_base_id: {},
       reputation: {
         type: DataTypes.INTEGER,

[Survived] ObjectLiteral
database/sequelize/models/Member.ts:15:21
         type: DataTypes.UUID,
         allowNull: false,
         primaryKey: true,
-        references: {
-          model: 'base_user',
-          key: 'base_user_id',
-        },
+        references: {},
         onDelete: 'cascade',
         onUpdate: 'cascade',

[Survived] ObjectLiteral
database/sequelize/models/Member.ts:36:39
   );
 
   Member.associate = (models) => {
-    Member.belongsTo(models.BaseUser, {
-      foreignKey: 'member_base_id',
-      targetKey: 'base_user_id',
-      as: 'BaseUser',
-    });
+    Member.belongsTo(models.BaseUser, {});
     Member.hasMany(models.Post, { foreignKey: 'member_id', as: 'Post' });
   };
