[Survived] BooleanLiteral
database/sequelize/models/Post.ts:23:20
       },
       type: {
         type: DataTypes.STRING(30),
-        allowNull: false,
+        allowNull: true,
       },
       title: {

[Survived] BooleanLiteral
database/sequelize/models/Post.ts:27:20
       },
       title: {
         type: DataTypes.TEXT,
-        allowNull: true,
+        allowNull: false,
       },
       text: {

[Survived] ObjectLiteral
database/sequelize/models/Post.ts:29:13
         type: DataTypes.TEXT,
         allowNull: true,
       },
-      text: {
-        type: DataTypes.TEXT,
-        allowNull: true,
-      },
+      text: {},
       link: {
         type: DataTypes.TEXT,

[Survived] BooleanLiteral
database/sequelize/models/Post.ts:39:20
       },
       slug: {
         type: DataTypes.STRING(300),
-        allowNull: false,
+        allowNull: true,
       },
       points: {

[Survived] ObjectLiteral
database/sequelize/models/Post.ts:46:27
         allowNull: false,
         defaultValue: 0,
       },
-      total_num_comments: {
-        type: DataTypes.INTEGER,
-        allowNull: false,
-        defaultValue: 0,
-      },
+      total_num_comments: {},
     },
     {

[Survived] ObjectLiteral
database/sequelize/models/Post.ts:52:5
         defaultValue: 0,
       },
     },
-    {
-      timestamps: true,
-      underscored: true,
-      tableName: 'post',
-    },
+    {},
   );
 

[Survived] ObjectLiteral
database/sequelize/models/Post.ts:60:35
   );
 
   Post.associate = (models) => {
-    Post.belongsTo(models.Member, {
-      foreignKey: 'member_id',
-      targetKey: 'member_id',
-      as: 'Member',
-    });
+    Post.belongsTo(models.Member, {});
     Post.hasMany(models.PostVote, { foreignKey: 'post_id', as: 'Votes' });
   };
