[Survived] ObjectLiteral
database/sequelize/models/PostVote.ts:21:18
         onDelete: 'cascade',
         onUpdate: 'cascade',
       },
-      member_id: {
-        type: DataTypes.UUID,
-        allowNull: false,
-        references: {
-          model: 'member',
-          key: 'member_id',
-        },
-        onDelete: 'cascade',
-        onUpdate: 'cascade',
-      },
+      member_id: {},
       type: {
         type: DataTypes.STRING(10),

[Survived] ObjectLiteral
database/sequelize/models/PostVote.ts:49:37
       targetKey: 'member_id',
       as: 'Member',
     });
-    PostVote.belongsTo(models.Post, { foreignKey: 'post_id', targetKey: 'post_id', as: 'Post' });
+    PostVote.belongsTo(models.Post, {});
   };
 
