[Timeout] ConditionalExpression
database/sequelize/models/index.ts:11:7
 // turns base_user => BaseUser
 function toCamelCase(str) {
   const _ = str.indexOf('_');
-  if (~_) {
+  if (true) {
     return toCamelCase(
       str.substring(0, _) +

[Timeout] UnaryOperator
database/sequelize/models/index.ts:11:7
 // turns base_user => BaseUser
 function toCamelCase(str) {
   const _ = str.indexOf('_');
-  if (~_) {
+  if (_) {
     return toCamelCase(
       str.substring(0, _) +

[Timeout] ArithmeticOperator
database/sequelize/models/index.ts:18:23
           .substring(_ + 1)
           .substring(0, 1)
           .toUpperCase() +
-        str.substring(_ + 2),
+        str.substring(_ - 2),
     );
   } else {

[Survived] BooleanLiteral
database/sequelize/models/index.ts:26:20
 }
 
 let models: any = {};
-let modelsLoaded = false;
+let modelsLoaded = true;
 
 const createModels = () => {

[Survived] ConditionalExpression
database/sequelize/models/index.ts:29:7
 let modelsLoaded = false;
 
 const createModels = () => {
-  if (modelsLoaded) return models;
+  if (true) return models;
 
   // Get all models

[Survived] ConditionalExpression
database/sequelize/models/index.ts:29:7
 let modelsLoaded = false;
 
 const createModels = () => {
-  if (modelsLoaded) return models;
+  if (false) return models;
 
   // Get all models

[Survived] ArrowFunction
database/sequelize/models/index.ts:35:7
   const modelsList = fs
     .readdirSync(path.resolve(__dirname, './'))
     .filter(
-      (t) =>
-        (~t.indexOf('.ts') || ~t.indexOf('.js')) && !~t.indexOf('index') && !~t.indexOf('.map'),
+      () => undefined,
     )
     .map((model) => sequelize.import(__dirname + '/' + model));

[Survived] ConditionalExpression
database/sequelize/models/index.ts:36:10
     .readdirSync(path.resolve(__dirname, './'))
     .filter(
       (t) =>
-        (~t.indexOf('.ts') || ~t.indexOf('.js')) && !~t.indexOf('index') && !~t.indexOf('.map'),
+        (true) && !~t.indexOf('index') && !~t.indexOf('.map'),
     )
     .map((model) => sequelize.import(__dirname + '/' + model));

[Survived] LogicalOperator
database/sequelize/models/index.ts:36:10
     .readdirSync(path.resolve(__dirname, './'))
     .filter(
       (t) =>
-        (~t.indexOf('.ts') || ~t.indexOf('.js')) && !~t.indexOf('index') && !~t.indexOf('.map'),
+        (~t.indexOf('.ts') && ~t.indexOf('.js')) && !~t.indexOf('index') && !~t.indexOf('.map'),
     )
     .map((model) => sequelize.import(__dirname + '/' + model));

[Survived] ConditionalExpression
database/sequelize/models/index.ts:41:19
     .map((model) => sequelize.import(__dirname + '/' + model));
 
   // Camel case the models
-  for (let i = 0; i < modelsList.length; i++) {
+  for (let i = 0; false; i++) {
     const modelName = toCamelCase(modelsList[i].name);
     models[modelName] = modelsList[i];

[Survived] EqualityOperator
database/sequelize/models/index.ts:41:19
     .map((model) => sequelize.import(__dirname + '/' + model));
 
   // Camel case the models
-  for (let i = 0; i < modelsList.length; i++) {
+  for (let i = 0; i >= modelsList.length; i++) {
     const modelName = toCamelCase(modelsList[i].name);
     models[modelName] = modelsList[i];

[Survived] ConditionalExpression
database/sequelize/models/index.ts:48:9
 
   // Create the relationships for the models;
   Object.keys(models).forEach((modelName) => {
-    if (models[modelName].associate) {
+    if (false) {
       models[modelName].associate(models);
     }

[Survived] ConditionalExpression
database/sequelize/models/index.ts:48:9
 
   // Create the relationships for the models;
   Object.keys(models).forEach((modelName) => {
-    if (models[modelName].associate) {
+    if (true) {
       models[modelName].associate(models);
     }

[Survived] BooleanLiteral
database/sequelize/models/index.ts:56:18
   models['sequelize'] = sequelize;
   models['Sequelize'] = Sequelize;
 
-  modelsLoaded = true;
+  modelsLoaded = false;
 
   return models;
