[NoCoverage] ConditionalExpression
infra/database/sequelize/runner.ts:6:11
     try {
       await command();
     } catch (err) {
-      if (err.original) {
+      if (false) {
         /**
          * This is an error that we can run into while seeding the same

[NoCoverage] ConditionalExpression
infra/database/sequelize/runner.ts:6:11
     try {
       await command();
     } catch (err) {
-      if (err.original) {
+      if (true) {
         /**
          * This is an error that we can run into while seeding the same

[NoCoverage] EqualityOperator
infra/database/sequelize/runner.ts:12:13
          * data. It's passable.
          */
 
-        if (err.original.code == 'ER_DUP_ENTRY') {
+        if (err.original.code != 'ER_DUP_ENTRY') {
           console.log(`>>> Passable error occurred: ER_DUP_ENTRY`);
         } else if (err.original.code == 'ER_DUP_FIELDNAME') {

[NoCoverage] ConditionalExpression
infra/database/sequelize/runner.ts:12:13
          * data. It's passable.
          */
 
-        if (err.original.code == 'ER_DUP_ENTRY') {
+        if (true) {
           console.log(`>>> Passable error occurred: ER_DUP_ENTRY`);
         } else if (err.original.code == 'ER_DUP_FIELDNAME') {

[NoCoverage] EqualityOperator
infra/database/sequelize/runner.ts:14:20
 
         if (err.original.code == 'ER_DUP_ENTRY') {
           console.log(`>>> Passable error occurred: ER_DUP_ENTRY`);
-        } else if (err.original.code == 'ER_DUP_FIELDNAME') {
+        } else if (err.original.code != 'ER_DUP_FIELDNAME') {
 
         /**

[NoCoverage] ConditionalExpression
infra/database/sequelize/runner.ts:14:20
 
         if (err.original.code == 'ER_DUP_ENTRY') {
           console.log(`>>> Passable error occurred: ER_DUP_ENTRY`);
-        } else if (err.original.code == 'ER_DUP_FIELDNAME') {
+        } else if (true) {
 
         /**

[NoCoverage] EqualityOperator
infra/database/sequelize/runner.ts:21:20
          * field name already exists.
          */
           console.log(`>>> Passable error occurred: ER_DUP_FIELDNAME`);
-        } else if (err.original.code == 'ER_CANT_DROP_FIELD_OR_KEY') {
+        } else if (err.original.code != 'ER_CANT_DROP_FIELD_OR_KEY') {
 
         /**

[NoCoverage] ConditionalExpression
infra/database/sequelize/runner.ts:21:20
          * field name already exists.
          */
           console.log(`>>> Passable error occurred: ER_DUP_FIELDNAME`);
-        } else if (err.original.code == 'ER_CANT_DROP_FIELD_OR_KEY') {
+        } else if (true) {
 
         /**

[NoCoverage] ConditionalExpression
infra/database/sequelize/runner.ts:28:20
          * that's cool. We can pass this.
          */
           console.log(`>>> Passable error occurred: ER_CANT_DROP_FIELD_OR_KEY`);
-        } else if (err.name == 'SequelizeUnknownConstraintError') {
+        } else if (false) {
           console.log(
             `>>> Passable error. Trying to remove constraint that's already been removed.`,

[NoCoverage] EqualityOperator
infra/database/sequelize/runner.ts:28:20
          * that's cool. We can pass this.
          */
           console.log(`>>> Passable error occurred: ER_CANT_DROP_FIELD_OR_KEY`);
-        } else if (err.name == 'SequelizeUnknownConstraintError') {
+        } else if (err.name != 'SequelizeUnknownConstraintError') {
           console.log(
             `>>> Passable error. Trying to remove constraint that's already been removed.`,
