[NoCoverage] ConditionalExpression
shared/infra/http/app.ts:26:14
 
 app.use('/api/v1', v1Router);
 
-const port = process.env.DEBUG_PORT || process.env.PORT || 5001;
+const port = false;
 
 app.listen(port, () => {

[NoCoverage] ConditionalExpression
shared/infra/http/app.ts:26:14
 
 app.use('/api/v1', v1Router);
 
-const port = process.env.DEBUG_PORT || process.env.PORT || 5001;
+const port = false || 5001;
 
 app.listen(port, () => {
