[NoCoverage] ConditionalExpression
infra/http/models/BaseController.ts:21:9
   }
 
   public ok<T>(res: express.Response, dto?: T) {
-    if (!!dto) {
+    if (false) {
       res.type('application/json');
       return res.status(200).json(dto);

[NoCoverage] ConditionalExpression
infra/http/models/BaseController.ts:21:9
   }
 
   public ok<T>(res: express.Response, dto?: T) {
-    if (!!dto) {
+    if (true) {
       res.type('application/json');
       return res.status(200).json(dto);
