[NoCoverage] ArrowFunction
src/shared/utils/FlowUtils.ts:3:24
 export class FlowUtils {
   public static delay(ms: number) {
-    return new Promise((resolve) => setTimeout(resolve, ms));
+    return new Promise(() => undefined);
   }
 }
