[NoCoverage] Regex
src/shared/utils/TextUtils.ts:18:7
 
   public static validateEmailAddress(email: string) {
     var re =
-      /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
+      /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[^a-zA-Z]{2,}))$/;
     return re.test(String(email).toLowerCase());
   }

[NoCoverage] Regex
src/shared/utils/TextUtils.ts:18:7
 
   public static validateEmailAddress(email: string) {
     var re =
-      /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
+      /^(([^<>()\[\]\\.,;:\s@"]+(\.[<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
     return re.test(String(email).toLowerCase());
   }

[NoCoverage] MethodExpression
src/shared/utils/TextUtils.ts:19:20
   public static validateEmailAddress(email: string) {
     var re =
       /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
-    return re.test(String(email).toLowerCase());
+    return re.test(String(email).toUpperCase());
   }
 

[Survived] EqualityOperator
src/shared/utils/TextUtils.ts:26:32
     const chars = '0123456789';
     let value = '';
 
-    for (let i = numberDigits; i > 0; --i) {
+    for (let i = numberDigits; i >= 0; --i) {
       value += chars[Math.round(Math.random() * (chars.length - 1))];
     }

[Survived] EqualityOperator
src/shared/utils/TextUtils.ts:26:32
     const chars = '0123456789';
     let value = '';
 
-    for (let i = numberDigits; i > 0; --i) {
+    for (let i = numberDigits; i <= 0; --i) {
       value += chars[Math.round(Math.random() * (chars.length - 1))];
     }

[Survived] ArithmeticOperator
src/shared/utils/TextUtils.ts:27:33
     let value = '';
 
     for (let i = numberDigits; i > 0; --i) {
-      value += chars[Math.round(Math.random() * (chars.length - 1))];
+      value += chars[Math.round(Math.random() / (chars.length - 1))];
     }
 

[Survived] ArithmeticOperator
src/shared/utils/TextUtils.ts:27:50
     let value = '';
 
     for (let i = numberDigits; i > 0; --i) {
-      value += chars[Math.round(Math.random() * (chars.length - 1))];
+      value += chars[Math.round(Math.random() * (chars.length + 1))];
     }
 
